Белгипрозем_2017/src/DataProcessors/мВыгрузкаСкановДоговоровНаДиск/мВыгрузкаСкановДоговоровНаДиск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>мВыгрузкаСкановДоговоровНаДиск</name>
</mdclass:DataProcessor>

Белгипрозем_2017/src/InformationRegisters/СвязиДокументов/СвязиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиДокументов</name>
  <resources>
    <name>СвязанныйДокументОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.ТипыСвязей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйДокумент</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязаннаяСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСвязанныйДокумент</name>
    <type>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>String</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/ВнутренниеДокументы/ВнутренниеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнутренниеДокументы</name>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Document.ВходящееПисьмо</basedOn>
  <basedOn>Document.ИсходящееПисьмо</basedOn>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭкземпляров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКорреспондентыДляСписков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеДействует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДел</name>
    <type>
      <types>CatalogRef.НоменклатураДел</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписалОтКорреспондента</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПродления</name>
    <type>
      <types>EnumRef.ПорядокПродления</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераЭтапов</name>
    <comment>На какие этапы влияет доп. соглашение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <comment>Ссылка на этап договора</comment>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>мСостояниеДела</name>
    <comment>Текущее состояние дела</comment>
    <type>
      <types>EnumRef.мСостоянияДела</types>
    </type>
  </attributes>
  <attributes>
    <name>мСистемаКоординат</name>
    <type>
      <types>CatalogRef.мСистемаКоординат</types>
    </type>
  </attributes>
  <attributes>
    <name>мНомерГеопортала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мНомерТехархива</name>
    <comment>Не используется!</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мИнвентарныйНомерТехархива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мДатаНачалаДействияДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>мЗаказчик</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>мНомерДелаЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мДатаДелаЗаказчика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мПроверил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>мВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
      <types>CatalogRef.мВидыРаботФизЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>мКакДоговорЮрЛица</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>мДокументыВозвращеныЗаказчику</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Корреспонденты</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписалОтКорреспондента</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляОбъекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СубъектыПерсональныхДанных</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Инвесторы</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписалОтКорреспондента</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/DataProcessors/мВыгрузкаСкановДоговоровНаДиск/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Выгрузить(Команда)
	Если Не ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		Сообщить("Выберите каталог");
		Возврат;
	КонецЕсли; 
	
	ПутиДоговоров.Очистить();
	
	ОпОп = Новый ОписаниеОповещения("ПослеПоискаФайлов", ЭтотОбъект);
	НачатьПоискФайлов(ОпОп, КаталогВыгрузки, "*.pdf", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПоискаФайлов(НайденныеФайлы, ДопПараметры) Экспорт
	
	ОбработатьНайденныеФайлы(НайденныеФайлы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНайденныеФайлы(НайденныеФайлы)
	СпНомеровДог = Новый СписокЗначений;
	
	Файлы.Очистить();
	ФайлыДел.Очистить();
	
	Для каждого Файл Из НайденныеФайлы Цикл
		Если Найти(Файл.ИмяБезРасширения, "дог") Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Найти(Файл.ИмяБезРасширения, "доп") > 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Позиция = СтрНайти(Файл.ИмяБезРасширения, "-", НаправлениеПоиска.СКонца, , 1);
		НомерДог = Лев(Файл.ИмяБезРасширения, Позиция-1);
		Если СпНомеровДог.НайтиПоЗначению(НомерДог) = Неопределено Тогда
			СпНомеровДог.Добавить(НомерДог);
			
			НовыйПуть = ПутиДоговоров.Добавить();
			НовыйПуть.НомерДог = НомерДог;
			НовыйПуть.Путь = Файл.Путь;
			
			//НовСтр = Файлы.Добавить();
			//НовСтр.НомерДог = НомерДог;
			//НовСтр.Путь = Файл.Путь;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ЗаполнитьТаблицуФайлов(СпНомеровДог);
	
	ЗаписатьФайлыНаДиск();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуФайлов(СпНомеровДог)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутренниеДокументы.Ссылка КАК Договор,
		|	ВнутренниеДокументы.РегистрационныйНомер
		|ПОМЕСТИТЬ Договоры
		|ИЗ
		|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|ГДЕ
		|	ВнутренниеДокументы.РегистрационныйНомер В(&СпНомеровДог)
		|	И ВнутренниеДокументы.ВидДокумента.Родитель = &ВидДокументаДоговоры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СвязиДокументов.СвязанныйДокумент КАК Справочник.ВнутренниеДокументы) КАК Дело
		|ПОМЕСТИТЬ Дела
		|ИЗ
		|	РегистрСведений.СвязиДокументов КАК СвязиДокументов
		|ГДЕ
		|	ВЫРАЗИТЬ(СвязиДокументов.Документ КАК Справочник.ВнутренниеДокументы) В
		|			(ВЫБРАТЬ
		|				Договоры.Договор
		|			ИЗ
		|				Договоры КАК Договоры)
		|	И СвязиДокументов.ТипСвязи = &ТипСвязи
		|	И ВЫРАЗИТЬ(СвязиДокументов.СвязанныйДокумент КАК Справочник.ВнутренниеДокументы).ВидДокумента = &ВидДокументаДело
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Файлы.Ссылка КАК Файл,
		|	Файлы.ТекущаяВерсияПутьКФайлу,
		|	Файлы.ТекущаяВерсияТом.ПолныйПутьWindows КАК ТекущаяВерсияТом,
		|	Договоры.РегистрационныйНомер КАК НомерДог,
		|	Договоры.Договор КАК Договор
		|ИЗ
		|	Договоры КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Договоры.Договор = Файлы.ВладелецФайла
		|			И (Файлы.ТекущаяВерсияРасширение = ""pdf"")
		|			И (Файлы.Наименование ПОДОБНО ""Дог%"")
		|			И (Файлы.ВладелецФайла В
		|				(ВЫБРАТЬ
		|					Договоры.Договор
		|				ИЗ
		|					Договоры КАК Договоры)) и
		|	НЕ Файлы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Файлы.Ссылка КАК Файл,
		|	Файлы.ТекущаяВерсияПутьКФайлу,
		|	Файлы.ТекущаяВерсияТом.ПолныйПутьWindows КАК ТекущаяВерсияТом,
		|	Дела.Дело КАК Дело,
		|	Дела.Дело.РегистрационныйНомер КАК НомерДела
		|ИЗ
		|	Дела КАК Дела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Дела.Дело = Файлы.ВладелецФайла И
		|	НЕ Файлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВидДокументаДоговоры", Справочники.ВидыВнутреннихДокументов.ДоговораЗемлеустроительныхРабот);
	Запрос.УстановитьПараметр("ВидДокументаДело", Справочники.ВидыВнутреннихДокументов.Дело);
	Запрос.УстановитьПараметр("СпНомеровДог", СпНомеровДог);
	Запрос.УстановитьПараметр("ТипСвязи", Справочники.ТипыСвязей.Имеет);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Отбор = Новый Структура("НомерДог", Выборка.НомерДог);
		//ИскСтрока = Файлы.НайтиСтроки(Отбор);
		//Если ИскСтрока.Количество() > 0 Тогда
		
		ИскСтрока = Файлы.Добавить();
		ИскСтрока.НомерДог = Выборка.НомерДог;
		ИскСтрока.Договор = Выборка.Договор;
		ИскСтрока.ТекущаяВерсияПутьКФайлу = Выборка.ТекущаяВерсияПутьКФайлу;
		ИскСтрока.ТекущаяВерсияТом = Выборка.ТекущаяВерсияТом;
		ИскСтрока.Файл = Выборка.Файл;
		
			//ИскСтрока[0].Договор = Выборка.Договор;
			//ИскСтрока[0].ТекущаяВерсияПутьКФайлу = Выборка.ТекущаяВерсияПутьКФайлу;
			//ИскСтрока[0].ТекущаяВерсияТом = Выборка.ТекущаяВерсияТом;
			//ИскСтрока[0].Файл = Выборка.Файл;
		//КонецЕсли; 
	КонецЦикла;
	
	Выборка = Результат[3].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИмяФайлаДела = СтрЗаменить(Выборка.НомерДела, "/", "-");
		Если Не ЗначениеЗаполнено(Выборка.Файл) Тогда
			// файла нет
			Продолжить;
		КонецЕсли; 
		
		Если СокрЛП(ИмяФайлаДела) = СокрЛП(Выборка.Файл.Наименование) Тогда
			// это скан самого дела
			Продолжить;
		КонецЕсли; 
		
		Позиция = СтрНайти(Выборка.НомерДела, "/", НаправлениеПоиска.СКонца, , 1);
		НомерДог = Лев(Выборка.НомерДела, Позиция-1);
		
		Стр = ФайлыДел.Добавить();
		Стр.НомерДог = НомерДог;
		Стр.Дело = Выборка.Дело;
		Стр.ТекущаяВерсияПутьКФайлу = Выборка.ТекущаяВерсияПутьКФайлу;
		Стр.ТекущаяВерсияТом = Выборка.ТекущаяВерсияТом;
		Стр.Файл = Выборка.Файл;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФайлыНаДиск()
	Док = Новый ТекстовыйДокумент;
	МассивОписаний=Новый Массив;
	Всего = Файлы.Количество() + ФайлыДел.Количество();
	Сч=0;
	Для каждого Стр Из Файлы Цикл
		Сч = Сч+1;
		Состояние("Поиск договоров... "+сч+" из "+Всего, Окр(Сч/Всего*100));
		ИмяФайлаНаСервере = Стр.ТекущаяВерсияТом+Стр.ТекущаяВерсияПутьКФайлу;
		
		Если Не ЗначениеЗаполнено(Стр.Договор) Тогда
			// не найден договор
			Док.ДобавитьСтроку("Не найден договор " + Стр.НомерДог);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИмяФайлаНаСервере) Тогда
			// не найден файл договора
			Док.ДобавитьСтроку("Не найден скан договора " + Стр.НомерДог);
			Продолжить;
		КонецЕсли;
		
		Адрес = ПолучитьФайл(ИмяФайлаНаСервере);
		
		ИмяФайла = СтрЗаменить(Стр.НомерДог, "/", "_");
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", "_");
		ИмяФайла = СтрЗаменить(ИмяФайла, ".", "_");
		ИмяФайла = ИмяФайла+" дог.pdf";
		
		Отбор = Новый Структура("НомерДог", Стр.НомерДог);
		ИскПуть = ПутиДоговоров.НайтиСтроки(Отбор);
		Если ИскПуть.Количество()=0 Тогда
			// не знаем подкаталог для сохранения
			Продолжить;
		КонецЕсли;
		
		Путь = ИскПуть[0].Путь;
		
		ИмяФайлаНаКлиенте = Путь + "/" + ИмяФайла;
		Описание = Новый ОписаниеПередаваемогоФайла(ИмяФайлаНаКлиенте, Адрес);
		МассивОписаний.Добавить(Описание);
		
		// получение доп файлов по делу
		ИскСтроки = ФайлыДел.НайтиСтроки(Отбор);
		
		Если ИскСтроки.Количество() > 0 Тогда
			
			Для й=0 По ИскСтроки.Количество()-1 Цикл
				Сч = Сч+1;
				ИмяФайлаНаСервере = ИскСтроки[й].ТекущаяВерсияТом+ИскСтроки[й].ТекущаяВерсияПутьКФайлу;
				Если Не ЗначениеЗаполнено(ИмяФайлаНаСервере) Тогда
					// не найден доп файл 
					Продолжить;
				КонецЕсли;
				
				Адрес = ПолучитьФайл(ИмяФайлаНаСервере);
				
				НомерДопФайла = й+1;
				ИмяФайла = Строка(ИскСтроки[й].Файл)+" доп" + НомерДопФайла+".pdf";
				
				//ИскПуть = ПутиДоговоров.НайтиСтроки(Отбор);
				//Если ИскПуть.Количество()=0 Тогда
				//	// не знаем подкаталог для сохранения
				//	Продолжить;
				//КонецЕсли;
				//
				//Путь = ИскПуть[0].Путь;
				
				ИмяФайлаНаКлиенте = Путь + "/" + ИмяФайла;
				Описание = Новый ОписаниеПередаваемогоФайла(ИмяФайлаНаКлиенте, Адрес);
				МассивОписаний.Добавить(Описание);
			
			КонецЦикла; 
		КонецЕсли; 
	
	КонецЦикла;
	
	ПоказатьОповещениеПользователя("Сохранение файлов на диск...");
	ПолучитьФайлы(МассивОписаний,,,Ложь);
	
	Если Док.КоличествоСтрок() > 0 Тогда
		Док.ДобавитьСтроку("");
		Док.ДобавитьСтроку("Передайте эту информацию в плановый отдел!");
		ИмяФайла = КаталогВыгрузки+"/"+Строка(Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧГ=0"))+Строка(Месяц(ТекущаяДата()))+Строка(День(ТекущаяДата()))+".txt";
		ПоказатьОповещениеПользователя("Создан файл ошибок: 
		|"+ИмяФайла, ИмяФайла);
		Док.Записать(ИмяФайла, "UTF-8");
		
		Док.Показать("Ошибки", ИмяФайла); 
	КонецЕсли; 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьФайл(ИмяФайлаНаСервере)
	Двоичное = Новый ДвоичныеДанные(ИмяФайлаНаСервере);
	Адрес = ПоместитьВоВременноеХранилище(Двоичное,  ЭтаФорма.УникальныйИдентификатор);
	Возврат Адрес;
КонецФункции

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	ДиалогВыбораФайла.ПолноеИмяФайла = "D:\Регистрация\1.Поступление\Содействие";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		КаталогВыгрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		КаталогВыгрузки = "D:\Регистрация\1.Поступление\Содействие";
	КонецЕсли; 
КонецПроцедуры
